// Functions in JS 


// -> част от програмата, 
// която извършва една конкретна задача и 
// съответно има някакво име. Името описва дейността на функцията

//Получават различни аргументи и спрямо тях да произвеждат различен резултат

// Защо се използват функции? -> По-лесно се менаджира, подобрява четимостта, 
// имената на функциите помагат да се разбере какво правят, 
// спестяват повторението на код, може да се извиква няколко пъти определена функция

//-----------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------

// Declaring and Invoking Functions 


// Function declaration (recommended way)

// function printText(text){
// console.log(text);
// }

// ********************************* 
// function sum(a, b) {
//     console.log(a+ b);
// }
// sum(5, 5)


// sum(5, 5)

// function sum(a, b) {
//     console.log(a+ b);
// }

// Забележка: И в двата случая работи !!!

//-----------------------------------------------------------------------------------

// Function expression (useful in functional programming)

// let printText = function(text){
// console.log(text);
// }

// *********************************

// Тук работи !!!

// let sum = function(a, b) {
//     console.log(a + b);
// }

// sum(5, 5);


// Тук не работи !!!

// sum(5, 5);

// let sum = function(a, b) {
//     console.log(a + b);
// }


//-----------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------

// Invoking a Function


// Invocation from another function

// // функция с вложени функции
// function printDocument() {
// printLabel();
// printContent();
// }


// Self-invocation (recursion)

// // recursion се изпълнява докато не се изпълни условието (x > 0)
// function countDown(x) {
// console.log(x);
// if (x > 0) { countDown(x - 1); }
// }


//-----------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------

// The Return Statement

// function readFullName(firstName, lastName) {
// return firstName + " " + lastName;
// }

// const fullName = readFullName("John","Smith");
// console.log(fullName) // John Smith

//-----------------------------------------------------------------------------------

// Using the Return Values


// Assigned to a variable
// let max = getMax(5, 10);

// Used in expression
// let total = getPrice() * quantity * 1.20;

// Passed to another function
// multiply(getMax(5, 10), 20)

//-----------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------

// Nested Functions

// Пример на такава функция !!!
// function swapElements(arr) {

//     for (let i = 0; i < arr.length / 2; i++) {
//         swap(arr, i, arr.length - 1 - i);
//     }

//     console.log(arr.join(' '));

//     function swap(elements, i, j) { -> отнася се за размяна на две стойности !!!
//         let temp = elements[i];
//         elements[i] = elements[j];
//         elements[j] = temp;
//     }
// }

//-------------------------------------------------------------------------------------------

// function completeArrSwap(arr) {  // -> отнася се за размяна на повече от две стойности !!!

// for (let i = 0; i < arr.length / 2; i++) {
//     swapTwoElements(arr, i, arr.length - 1 - i);
// }


// function swapTwoElements(arr, i, j) { // -> отнася се за размяна на две стойности !!!
// за да работи се създава временна променлива която пази стойността на 0 индекс
// let temp = arr[i];
// arr[i] = arr[j];
// arr[j] = temp;

//     // тези два реда няма да работят, защото при първата операция елемента на 0 индекс не се запазва !!!
//      arr[i] = arr[j];
//      arr[j] = arr[i];
// }

// }


// arr = [1, 5, 6, 100, 10, -4];
// completeArrSwap(arr);
// console.log(arr);


// arr = [1, 5, 6, 100, 10, -4]
// swapTwoElements (arr, 0, 3) // разменя местата на 0, 3 индекс


//-----------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------

// Functional Programming in JS

// --->> First-Class Functions --> се третират като всяка друга променлива

// function transformToUpperCase(message) {
//     return message.toUpperCase();
// }


// function transformToLowerCase(message) {
//     return message.toLowerCase();
// }


// function printFinalMessage(message, transformFunction) {
//     console.log(transformFunction(message));
// }


// printFinalMessage('Hello my friend Stoyan!!', transformToUpperCase);

//-----------------------------------------------------------------------------------

// returned --->> една функция връща друга функция които са вложени една в друга

// function sayHello() {
//     return function () {
//         console.log('Hello!');
//     }
// }

//-----------------------------------------------------------------------------------

// --> една функция можем да си я присвоим като стойност на променлива 

// const write = function () {
//     return "Hello, world!";
// }

// console.log(write()); // Hello, world!


//-----------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------

// Arrow Functions - предоставят съкратен синтаксис за работа с функции. 
// Те могат да се присвояват като стойности на променливи

// let increment = x => x + 1;
// console.log(increment(5)); // 6

// let sum = (a, b) => a + b;
// console.log(sum(5, 6)); // 11


//-----------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------

// Добри практики за именуване на функции 

// -> Смислени имена
// -> camelCase
// -> Името на функцията трябва да бъде отговор на въпроса, "Какво прави функцията?" 

//-----------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------

// Добри практики за именуване на параметри

// -> Смислени имена - прилагателно и съществително 
// -> camelCase

//-----------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------

// Functions – Best Practices

// Всяка функция трябва да изпълнява само ЕДНА задача !!!!
// Избягват се функции по-дълги от един екран !!!